nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_utils.c
#if 0 /* not used anymore */
/* Disable all interrupts for NVIC except RSM IRQ and global interrupt enable */
/* Note that TPM used for ToF does not need need IRQ */
void lcl_hadm_disable_interrupts(void)
{
    OSA_DisableIRQGlobal();
    nvic_backup = NVIC->ICER[0];
    NVIC->ICER[0] = 0xffffffff; // disable all interrupts
}

void lcl_hadm_restore_interrupts(void)
{
    NVIC->ISER[0] = nvic_backup;
    OSA_EnableIRQGlobal();
}

void lcl_hadm_init_tpms(void)
{
    tpm_config_t tpmInfo;
    TPM_GetDefaultConfig(&tpmInfo);
    
    TPM_Init(HADM_TPM, &tpmInfo);
    TPM_SetupOutputCompare(HADM_TPM, HADM_TPM_TIMER_CHANNEL, kTPM_NoOutputSignal, HADM_TPM_MODULO); // software compare
    HADM_TPM->CONTROLS[HADM_TPM_TIMER_CHANNEL].CnV = HADM_TPM_MODULO;
    TPM_SetTimerPeriod(HADM_TPM, HADM_TPM_MODULO);
}

void lcl_hadm_start_tpms(void)
{    
    HADM_TPM->CNT = 0;
    TPM_ClearStatusFlags(HADM_TPM, (1<<HADM_TPM_TIMER_CHANNEL));
    TPM_StartTimer(HADM_TPM, kTPM_SystemClock);
}

void lcl_hadm_stop_tpms(void)
{
    TPM_StopTimer(HADM_TPM);
}

void lcl_hadm_reset_tpm_count(void)
{    
    HADM_TPM->CNT = 0;
}

void lcl_hadm_tpm_timer_start(uint16_t delay_us)
{
    TPM_SetupOutputCompare(HADM_TPM, HADM_TPM_TIMER_CHANNEL, kTPM_NoOutputSignal, (delay_us << 5) & HADM_TPM_MODULO); // software compare
    TPM_EnableInterrupts(HADM_TPM, (uint32_t)(1U << HADM_TPM_TIMER_CHANNEL)); // enable interrupt for timer channel
    TPM_ClearStatusFlags(HADM_TPM, 1<<HADM_TPM_TIMER_CHANNEL);
    NVIC_ClearPendingIRQ(TPM2_INT_IRQn);
}

void lcl_hadm_tpm_timer_stop(void)
{
    TPM_DisableInterrupts(HADM_TPM, (uint32_t)(1U << HADM_TPM_TIMER_CHANNEL)); // enable interrupt for timer channel
    /* disable channel, no SDK API to do that... */
    HADM_TPM->CONTROLS[HADM_TPM_TIMER_CHANNEL].CnSC &= ~(TPM_CnSC_MSA_MASK | TPM_CnSC_MSB_MASK | TPM_CnSC_ELSA_MASK | TPM_CnSC_ELSB_MASK);
}
#endif

void lcl_hadm_utils_compute_iq_buff_size(const BLE_HADM_SubeventConfig_t *hadm_config_p, hadm_meas_t *hadm_meas_p, uint32_t sample_rate)
{
    uint32_t nb_samples_per_pm;

    if (hadm_meas_p->iq_avg_win > 0U)
    {
        assert((hadm_meas_p->iq_capture_win * sample_rate) >= (1 << hadm_meas_p->iq_avg_win));
        assert(((hadm_meas_p->iq_capture_win * sample_rate) &  ((1 << hadm_meas_p->iq_avg_win) - 1)) == 0);
        assert((hadm_meas_p->iq_capture_win * sample_rate) >= (1 << hadm_meas_p->iq_avg_win));
        assert(((hadm_meas_p->iq_capture_win * sample_rate) &  ((1 << hadm_meas_p->iq_avg_win) - 1)) == 0);
    }

    nb_samples_per_pm = HADM_NUM_IQ_PER_US((uint32_t)hadm_meas_p->iq_capture_win, (uint32_t)hadm_config_p->rttPhy, hadm_meas_p->iq_avg_win);
    if (hadm_config_p->role == HADM_ROLE_INITIATOR)
    {
        hadm_meas_p->iq_buff_size_mode0 = (uint16_t)(nb_samples_per_pm * hadm_config_p->mode0Nb);
    }
    else
    {
       hadm_meas_p->iq_buff_size_mode0 = 0;
    }
    hadm_meas_p->iq_buff_size = (uint16_t)(nb_samples_per_pm * ((uint32_t)hadm_meas_p->n_ap + 1U) * (hadm_config_p->stepsNb - hadm_config_p->mode0Nb));
}

/* Compute HADM step duration in us for all modes */
void lcl_hadm_utils_compute_step_duration(const BLE_HADM_SubeventConfig_t *hadm_config_p, uint32_t n_ap, uint16_t *mode_dur)
{
    mode_dur[0U] = (uint16_t)((uint32_t)hadm_config_p->T_FCS_Time + 2U*HADM_T_SY(hadm_config_p->rttPhy) + 2U*HADM_T_RD + (uint32_t)hadm_config_p->T_IP1_Time + HADM_T_FM + HADM_T_GD); /* T_FCS + 2*T_SY + 2*T_RD + T_IP1 + T_GD + T_FM */
    /* not used */
    mode_dur[1U] = 0;
    mode_dur[2U] = 0;
    mode_dur[3U] = 0;
}

#define INIT_ACI_SINGLE_ANT (1U<<6U | 1U<<5U | 1U<<4U | 1U<<0U) /* ACI of 6,5,4,0 all have single antenna for INIT role */
#define REFL_ACI_SINGLE_ANT (1U<<3U | 1U<<2U | 1U<<1U | 1U<<0U) /* ACI of 3,2,1,0 all have single antenna for REFL role */
static bool is_single_antenna_config(hadm_meas_t *hadm_meas_p)
{
  bool single_ant = false;
  uint8_t aci_bit = 1U<<(uint8_t)(hadm_meas_p->config_p->toneAntennaConfigIdx);
  /* ACI bits have role specific cases where a single antenna is needed */
  if (hadm_meas_p->config_p->role == HADM_ROLE_INITIATOR)
  {
    single_ant = ((INIT_ACI_SINGLE_ANT & aci_bit) == aci_bit);
  }
  else
  {
    single_ant = ((REFL_ACI_SINGLE_ANT & aci_bit) == aci_bit);
  }
  
  return single_ant;
}

void lcl_hadm_utils_configure_antenna_switching(hadm_meas_t *hadm_meas_p, bool ena_antsw_pa_ramping)
{
    uint8_t default_antenna_idx = 0U; /* index of default antenna for 1:1 (A1) */
    xcvrLclStatus_t status;

    /* Perform antenna permutation index to antenna index mapping */
    /* " Most antenna configurations described below are 1:X or X:1 orientations where X is in the set of 1 to 4.
     * In these configurations, antenna path AP1 is assigned to the 1:1 antenna combination, AP2 is assigned to the 1:2 or 2:1 combination,
     * AP3 is assigned to the 1:3 or 3:1 combination and AP4 is assigned to the 1:4 or 4:1 combination.
     * The exception is the 2:2 configuration where AP1 is assigned to 1:1, AP2 is assigned to 1:2, AP3 is assigned to 2:1 and AP4 is assigned to 2:2. " */
    if (is_single_antenna_config(hadm_meas_p))
    {
        uint8_t ant_gpio[HADM_MAX_NB_ANTENNA_PATHS];
        ant_gpio[0] = hadm_device.ant2gpio[default_antenna_idx];
        ant_gpio[1] = hadm_device.ant2gpio[default_antenna_idx];
        ant_gpio[2] = hadm_device.ant2gpio[default_antenna_idx];
        ant_gpio[3] = hadm_device.ant2gpio[default_antenna_idx];
        status = XCVR_LCL_ConfigLclBlock(&hadm_meas_p->rsm_config, (XCVR_RSM_T_CAPTURE_SEL_T)hadm_meas_p->config_p->T_PM_Time, ant_gpio, ena_antsw_pa_ramping);
    }
    else
    if (hadm_meas_p->config_p->toneAntennaConfigIdx == HADM_ANT_CFG_IDX_7)
    {
        uint8_t ant_gpio[HADM_MAX_NB_ANTENNA_PATHS];
        uint32_t role = (uint32_t)hadm_meas_p->config_p->role;
        ant_gpio[0] = hadm_device.ant2gpio[hadm_ant_perm_to_idx[role][0]];
        ant_gpio[1] = hadm_device.ant2gpio[hadm_ant_perm_to_idx[role][1]];
        ant_gpio[2] = hadm_device.ant2gpio[hadm_ant_perm_to_idx[role][2]];
        ant_gpio[3] = hadm_device.ant2gpio[hadm_ant_perm_to_idx[role][3]];
        status = XCVR_LCL_ConfigLclBlock(&hadm_meas_p->rsm_config, (XCVR_RSM_T_CAPTURE_SEL_T)hadm_meas_p->config_p->T_PM_Time, ant_gpio, ena_antsw_pa_ramping);
    }
    else /* direct map btw antenna path and antenna index */
    {
        status = XCVR_LCL_ConfigLclBlock(&hadm_meas_p->rsm_config, (XCVR_RSM_T_CAPTURE_SEL_T)hadm_meas_p->config_p->T_PM_Time, hadm_device.ant2gpio, ena_antsw_pa_ramping);
    }
    assert(status == gXcvrLclStatusSuccess);
    (void)status;
}

uint8_t lcl_hadm_utils_get_CS_SYNC_antenna(hadm_meas_t *hadm_meas_p)
{
    uint32_t ant_id; /* to be used for this CS step */

    if (hadm_meas_p->config_p->rttAntennaID == HADM_RTT_ANT_NO_RECOMMENDATION)
    {
        /* Custom implementation to cross antennas on both devices */
        ant_id = hadm_ant_perm_to_idx[hadm_meas_p->config_p->role][hadm_meas_p->rtt_antenna_id];
        /* Compute next */
        hadm_meas_p->rtt_antenna_id = (hadm_meas_p->rtt_antenna_id + 1U) % hadm_meas_p->n_ap;
    }
    else
    {
        ant_id = hadm_meas_p->rtt_antenna_id;
        if (hadm_meas_p->config_p->rttAntennaID == HADM_RTT_ANT_ROUND_ROBIN)
        {
            /* Compute next */
            hadm_meas_p->rtt_antenna_id = (hadm_meas_p->rtt_antenna_id + 1U) % hadm_meas_p->num_ant; /* round robin */
        }
    }
    return (uint8_t)ant_id;
}

#define PCT_FIXED_POINT_UNIT  14

